[Templates]
Count=6
[Template1]
ID=explain_basic
Title=代码解释
Content=解释这段代码的核心逻辑、输入输出、关键函数作用，用新手能懂的语言，标注易错点
Icon=💡
Category=基础
[Template2]
ID=refactor_basic
Title=代码重构
Content=重构这段代码，遵循PEP8/行业规范，简化冗余逻辑，添加中文注释，保持功能不变
Icon=🔧
Category=基础
[Template3]
ID=optimize_basic
Title=性能优化
Content=分析这段代码的性能瓶颈（时间/空间复杂度），给出优化方案+对比说明，保留原逻辑可读性
Icon=⚡
Category=基础
[Template4]
ID=code_review
Title=代码审查
Content=请对这段代码进行全面审查，指出潜在问题、bug、安全隐患和改进建议
Icon=🔍
Category=专业
[Template5]
ID=architecture_analysis
Title=架构分析
Content=请从专业的角度分析这段代码，包括架构设计、设计模式、技术选型等方面的考量
Icon=🏗️
Category=专业
[Template6]
ID=teach_code
Title=教学解释
Content=请用教学的方式解释这段代码，适合初学者理解，包括基本概念、工作原理和实际应用场景
Icon=📚
Category=教学
